# · Предпазен найлон - 1.50 лв. за кв. метър
# · Боя - 14.50 лв. за литър
# · Разредител за боя - 5.00 лв. за литър
# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
# Входът се чете от конзолата и съдържа точно 4 реда:
# 1. Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
# 2. Необходимо количество боя (в литри) - цяло число в интервала [1…100]
# 3. Количество разредител (в литри) - цяло число в интервала [1…30]
# 4. Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
# Изход
# Да се отпечата на конзолата един ред:
# · "{сумата на всички разходи}"
nailon = int(input())
paint = int(input())
razreditel = int(input())
hours = int(input())

nailon = (nailon+2)*1.5
paint = (paint+paint*0.1)*14.5
razreditel = razreditel*5
sum = nailon + paint+razreditel+0.4
maistori = sum*0.3*hours
all = sum+maistori
print(all)
